app/views/alumnos/estadistica_alum.html.erb

SELECT COUNT(*) FROM "alumnos" INNER JOIN "practicas" ON "practicas"."alumno_id" = "alumnos"."id"
---
<%= pie_chart @alum %>
<%total = Alumno.joins(:practica).count%>