app/views/practicas/estadistica_herramienta.html.erb

SELECT COUNT(*) FROM "herramientas" INNER JOIN "practicas" ON "practicas"."herramienta_id" = "herramientas"."id"
---
<%= pie_chart @cant %>
<%total = Herramienta.joins(:practica).count%>