app/views/practicas/estadistica_area.html.erb

<%= pie_chart @are %>
<%total = Area.joins(:practica).count%>
---
SELECT COUNT(*) FROM "areas" INNER JOIN "practicas" ON "practicas"."area_id" = "areas"."id"