app/views/practicas/estadistica_empresa.html.erb

SELECT COUNT(*) FROM "empresas" INNER JOIN "practicas" ON "practicas"."empresa_id" = "empresas"."id"
---
<%= pie_chart @emp %>
<%total = Empresa.joins(:practica).count%>